In [5]:
import pandas as pd
import numpy as np

import warnings
warnings.simplefilter(action='ignore' )

In [4]:
rentals = pd.read_csv("https://raw.githubusercontent.com/juliandnl/redi_ss20/master/berlin_rental.csv")
df = rentals.copy()
df.head()

        Region       Condition  Rooms     Rent  Year_Construction   Space
0        Mitte  first_time_use    4.0  2659.00               2019  117.20
1    Kreuzberg  first_time_use    1.0  1200.00               2020   29.33
2     Köpenick       well_kept    2.0   979.00               1997   83.61
3  Wilmersdorf       well_kept    4.0  1830.22               1900  171.18
4    Kreuzberg  first_time_use    2.0  2272.00               2020   88.27

In [6]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 764 entries, 0 to 763
Data columns (total 6 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   Region             764 non-null    object
 1   Condition          764 non-null    object
 2   Rooms              764 non-null    float64
 3   Rent               764 non-null    float64
 4   Year_Construction  764 non-null    int64
 5   Space              764 non-null    float64
dtypes: float64(3), int64(1), object(2)
memory usage: 35.9+ KB

# 1.How many apartments are there in Mitte in a 'well-kept' condition?

In [7]:
df.loc[(df.Region == 'Mitte') & (df.Condition == 'well_kept')]

    Region  Condition  Rooms     Rent  Year_Construction   Space
15   Mitte  well_kept    2.0  1505.60               2018   75.28
272  Mitte  well_kept    3.0  1639.00               2014   96.00
392  Mitte  well_kept    1.0   924.44               2000   61.14
608  Mitte  well_kept    3.0  1800.00               2013   80.95
735  Mitte  well_kept    2.0  1350.00               2014   68.00
736  Mitte  well_kept    3.0  3500.00               2009  165.00

# 2.How many apartments are there in Kreuzberg built before 1900?

In [9]:
df.loc[(df.Region == 'Kreuzberg') & (df.Year_Construction < 1900)]

,Region,Condition,Rooms,Rent,Year_Construction,Space
76,Kreuzberg,first_time_use,5.0,4400.0,1867,236.0
401,Kreuzberg,refurbished,4.0,2850.0,1895,127.0
697,Kreuzberg,first_time_use_after_refurbishment,2.0,1399.0,1874,50.0

# 3.What are the average spaces of the apartments by the number of rooms?

In [29]:
#df.groupby('Rooms')[['Space']].mean().round()
df.groupby('Rooms')[['Space']].mean()

            Space
Rooms
1.0     34.470748
1.5     41.361111
2.0     65.015725
2.5     90.463125
3.0     99.403167
3.5     98.037500
4.0    130.863333
4.5    106.100000
5.0    194.400526
6.0    237.000000
7.0    251.000000

# 4.Which is the most expensive region on average and what is the maximum rent for this region?

In [30]:
df.groupby('Region')[['Rent']].mean().sort_values('Rent', ascending=False).round(2)

                    Rent
Region
Mitte            2408.73
Kreuzberg        2049.14
Prenzlauer       1996.96
Tiergarten       1914.82
Charlottenburg   1753.45
Wilmersdorf      1748.65
Neukölln         1188.11
Köpenick         1125.48
Friedrichsfelde  1043.87
Wedding           847.14

In [17]:
df.loc[df.Region == 'Mitte', 'Rent'].max()

14207.0

In [20]:
df.loc[df.Region == 'Mitte', 'Rent'].sort_values(ascending= False)

694    14207.00
281     6855.48
653     6022.50
591     5936.40
590     5936.40
         ...
66       889.00
751      770.00
26       715.00
730      655.00
607      398.00
Name: Rent, Length: 153, dtype: float64

In [22]:
df.query('Rent==14207')

    Region       Condition  Rooms     Rent  Year_Construction   Space
694  Mitte  mint_condition    5.0  14207.0               2015  413.91

# Bonus Question: 5. What are the min, max and average number of rooms of the apartments in Köpenick?

In [31]:
#df.loc[df.Region == 'Köpenick', 'Rooms'].describe()[['min', 'max', 'mean']]
df.loc[df.Region == 'Köpenick', 'Rooms'].describe()[[3,7,1]]

min     1.000000
max     4.000000
mean    2.281818
Name: Rooms, dtype: float64